cmsis-svd/cmsis-svd/data/Freescale/MKV44F15.xml
        <register>
          <name>CLIST2</name>
          <description>ADC Channel List Register 2</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7654</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SAMPLE4</name>
              <description>Sample Field 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE5</name>
              <description>Sample Field 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE6</name>
              <description>Sample Field 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE7</name>
              <description>Sample Field 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ANA0, Differential: ANA0+, ANA1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ANA1, Differential: ANA0+, ANA1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ANA2, Differential: ANA2+, ANA3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ANA3, Differential: ANA2+, ANA3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ANA4, Differential: ANA4+, ANA5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ANA5, Differential: ANA4+, ANA5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ANA6, Differential: ANA6+, ANA7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ANA7, Differential: ANA6+, ANA7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ANB0, Differential: ANB0+, ANB1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ANB1, Differential: ANB0+, ANB1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ANB2, Differential: ANB2+, ANB3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ANB3, Differential: ANB2+, ANB3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ANB4, Differential: ANB4+, ANB5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ANB5, Differential: ANB4+, ANB5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ANB6, Differential: ANB6+, ANB7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ANB7, Differential: ANB6+, ANB7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
